Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes enum provides the toleration hit types as the integer values used in core.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.None
No toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Free
The free toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Grid
The grid toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Geometry
The geometry toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Reference
The reference toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Points
The points toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.End
The end toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Center
The center toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Mid
The mid toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Intersection
The intersection toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Perpendicular
The perpendicular toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Near
The near toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Objects
The objects toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.ObjectsInJoints
The objects in joints toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Extension
The extension toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.ZkitOrthogonal
The Z-kit orthogonal toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Line
The line toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Orthogonal
The orthogonal toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.TemporaryGraphic
The snappable temporary graphic toleration hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Exact
The hit type is based on exact input, such as numeric input.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Behaved
The hit point has been behaved.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.Limited
The hit point has been limited.